---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsSingledayStudyType
source: html/23b4c71b-ef72-3bd4-77be-cf66d60f14d0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsSingledayStudyType Property

"Single day study"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyIsSingledayStudyType { get; }
```